import { Injectable } from '@angular/core';

export class date {
  constructor(public id: number, public ct: Array<any>) { }
}
export class tab {

}
let dates: date[] = [
  new date
  (11, [
      {"行项目号":"111","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"112","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"113","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"114","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"115","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"}
  ]),
  new date 
  (12, [
     {"行项目号":"121","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"112","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"113","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"114","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"115","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"}
  ]),
  new date 
  (13, [
      {"行项目号":"131","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"112","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"113","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"114","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"},
      {"行项目号":"115","物料号":"22.0440","物料描述":"0","数量":"0","工厂":"-0.20","库存地":"-0.10","批次":"-0.20","原销售总额":"-0.20","原返款金额":"-0.20","新销售净额":"-0.20"}
  ])
];

@Injectable()
export class tabService {
  constructor(){};

  getTabs() {
    var tabs = [];
    for(var i=0;i<dates.length;i++){
      tabs.push(dates[i].id)
    }
    return tabs;
  }
  getHead(id){
    var head = [];
    for(var i=0;i<dates.length;i++){
      if(id == dates[i].id){
        for(var j=0;j<dates[i].ct.length;j++){
          if(j==0){
            for (var key in dates[i].ct[j]) {
              head.push(key);
            }
          }
        }
        return head;
      }
    }
  }
  public table = [];
  getTable(id) {
    for(var i=0;i<dates.length;i++){
      if(id == dates[i].id){
        this.table=dates[i].ct;
        return this.table
      }
    }
  }
  addItems(e){
    let currentId= +e[e.length-1].行项目号+1;
    this.table.push(
      {
      "行项目号":currentId,"物料号":"","物料描述":"","数量":"","工厂":"","库存地":"","批次":"","原销售总额":"","原返款金额":"","新销售净额":""
    }
    )
  }
  removeItems(items){
    let index = this.table.indexOf(items);
    this.table.splice(index,1);
  }
  //初始化首项active为true

  // getDemo(id: number | string) {
  //   return this.getDemoes()
  //     .then(Demoes => Demoes.find(Demo => Demo.id === +id));
  // }

}
